tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "libpng"
brew "libtiff"
brew "lz4"
brew "openexr"
brew "zstd"
brew "ca-certificates"
brew "openssl@3"
brew "asio"
brew "assimp"
brew "atool"
brew "autojump"
brew "boost"
brew "boost-python3"
brew "freetype"
brew "pkg-config"
brew "catch2"
brew "eigen"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "compiledb"
brew "ctags"
brew "doxygen"
brew "elinks"
brew "exiftool"
brew "jpeg", link: true
brew "zeromq"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fortune"
brew "freeglut"
brew "git-gui"
brew "git-lfs"
brew "glew"
brew "glfw"
brew "glm"
brew "highlight"
brew "lazygit"
brew "libcaca"
brew "llvm"
brew "lynx"
brew "media-info"
brew "mpich"
brew "mplayer"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "ossp-uuid"
brew "pandoc"
brew "pcl"
brew "pcre"
brew "poco"
brew "poppler"
brew "postgresql@14"
brew "qt"
brew "ranger"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "rustup-init"
brew "telnet"
brew "thefuck"
brew "tig"
brew "tinyxml"
brew "tinyxml2"
brew "transmission-cli"
brew "tree"
brew "trunk"
brew "w3m"
brew "wget"
brew "xmake"
brew "yadm"
brew "youtube-dl"
brew "railwaycat/emacsmacport/emacs-mac"
cask "1password-cli"
cask "alt-tab"
cask "android-file-transfer"
cask "bob"
cask "downie"
cask "fig"
cask "font-source-code-pro"
cask "karabiner-elements"
cask "linearmouse"
cask "mdimagesizemdimporter"
cask "notion"
cask "obs"
cask "only-switch"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "scroll-reverser"
cask "shottr"
cask "sourcetrail"
cask "sourcetree"
cask "steam"
cask "switchhosts"
cask "v2rayu"
cask "visual-studio-code"
